package homework;

/*
    Написать программу, которая выведет на консоль все целые числа в диапазоне от 20 до 40
 */
public class HomeWork1 {

    public static void main(String args[]){
        for (int i = 20; i <= 40; i++){
            System.out.println(i);
        }
    }
}
